yoneken/rosserial_stm32/src/ros_lib/examples/imu/Src/inv_mpu.cpp
      SPI_Mem_Read(CS_IMU_Pin, st.reg->fifo_r_w, length, [](uint8_t *data){
        more[0] = fifo_count / length - 1;
      });
    });
    return 0;
}

/**
 *  @brief      Set device to bypass mode.
 *  @param[in]  bypass_on   1 to enable bypass mode.
 *  @return     0 if successful.
 */
int mpu_set_bypass(unsigned char bypass_on)
{
    unsigned char tmp;

    if (st.chip_cfg.bypass_mode == bypass_on)
        return 0;

    if (bypass_on) {
      SPI_Mem_Read(CS_IMU_Pin, st.reg->user_ctrl, 1, [](uint8_t *tmp){
        tmp &= ~BIT_AUX_IF_EN;
        if (SPI_Mem_Write(CS_IMU_Pin, st.reg->user_ctrl, 1, &tmp))
            return -1;
        delay_ms(3);
        tmp = BIT_BYPASS_EN;
        if (st.chip_cfg.active_low_int)
            tmp |= BIT_ACTL;
        if (st.chip_cfg.latched_int)
            tmp |= BIT_LATCH_EN | BIT_ANY_RD_CLR;
        if (SPI_Mem_Write(CS_IMU_Pin, st.reg->int_pin_cfg, 1, &tmp))
            return -1;
      });
    } else {
      /* Enable I2C master mode if compass is being used. */
      SPI_Mem_Read(CS_IMU_Pin, st.reg->user_ctrl, 1, [](uint8_t *tmp){
        if (st.chip_cfg.sensors & INV_XYZ_COMPASS)
            tmp |= BIT_AUX_IF_EN;
        else
            tmp &= ~BIT_AUX_IF_EN;
        if (SPI_Mem_Write(CS_IMU_Pin, st.reg->user_ctrl, 1, &tmp))
            return -1;
        delay_ms(3);
        if (st.chip_cfg.active_low_int)
            tmp = BIT_ACTL;
        else
            tmp = 0;
        if (st.chip_cfg.latched_int)
            tmp |= BIT_LATCH_EN | BIT_ANY_RD_CLR;
        if (SPI_Mem_Write(CS_IMU_Pin, st.reg->int_pin_cfg, 1, &tmp))
            return -1;
      });
    }
    st.chip_cfg.bypass_mode = bypass_on;
    return 0;
}

/**
 *  @brief      Set interrupt level.
 *  @param[in]  active_low  1 for active low, 0 for active high.
 *  @return     0 if successful.
 */
int mpu_set_int_level(unsigned char active_low)
{
    st.chip_cfg.active_low_int = active_low;
    return 0;
}

/**
 *  @brief      Enable latched interrupts.
 *  Any MPU register will clear the interrupt.
 *  @param[in]  enable  1 to enable, 0 to disable.
 *  @return     0 if successful.
 */
int mpu_set_int_latched(unsigned char enable)
{
    unsigned char tmp;
    if (st.chip_cfg.latched_int == enable)
        return 0;

    if (enable)
        tmp = BIT_LATCH_EN | BIT_ANY_RD_CLR;
    else
        tmp = 0;
    if (st.chip_cfg.bypass_mode)
        tmp |= BIT_BYPASS_EN;
    if (st.chip_cfg.active_low_int)
        tmp |= BIT_ACTL;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->int_pin_cfg, 1, &tmp))
        return -1;
    st.chip_cfg.latched_int = enable;
    return 0;
}

#ifdef AK89xx_SECONDARY
static int compass_self_test(void)
{
    unsigned char tmp[6];
    unsigned char tries = 10;
    int result = 0x07;
    short data;

    mpu_set_bypass(1);

    tmp[0] = AKM_POWER_DOWN;
    if (i2c_write(st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, tmp))
        return 0x07;
    tmp[0] = AKM_BIT_SELF_TEST;
    if (i2c_write(st.chip_cfg.compass_addr, AKM_REG_ASTC, 1, tmp))
        goto AKM_restore;
    tmp[0] = AKM_MODE_SELF_TEST;
    if (i2c_write(st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, tmp))
        goto AKM_restore;

    do {
        delay_ms(10);
        if (i2c_read(st.chip_cfg.compass_addr, AKM_REG_ST1, 1, tmp))
            goto AKM_restore;
        if (tmp[0] & AKM_DATA_READY)
            break;
    } while (tries--);
    if (!(tmp[0] & AKM_DATA_READY))
        goto AKM_restore;

    if (i2c_read(st.chip_cfg.compass_addr, AKM_REG_HXL, 6, tmp))
        goto AKM_restore;

    result = 0;
#if defined MPU9150
    data = (short)(tmp[1] << 8) | tmp[0];
    if ((data > 100) || (data < -100))
        result |= 0x01;
    data = (short)(tmp[3] << 8) | tmp[2];
    if ((data > 100) || (data < -100))
        result |= 0x02;
    data = (short)(tmp[5] << 8) | tmp[4];
    if ((data > -300) || (data < -1000))
        result |= 0x04;
#elif defined MPU9250
    data = (short)(tmp[1] << 8) | tmp[0];
    if ((data > 200) || (data < -200))  
        result |= 0x01;
    data = (short)(tmp[3] << 8) | tmp[2];
    if ((data > 200) || (data < -200))  
        result |= 0x02;
    data = (short)(tmp[5] << 8) | tmp[4];
    if ((data > -800) || (data < -3200))  
        result |= 0x04;
#endif
AKM_restore:
    tmp[0] = 0 | SUPPORTS_AK89xx_HIGH_SENS;
    i2c_write(st.chip_cfg.compass_addr, AKM_REG_ASTC, 1, tmp);
    tmp[0] = SUPPORTS_AK89xx_HIGH_SENS;
    i2c_write(st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, tmp);
    mpu_set_bypass(0);
    return result;
}
#endif

static int get_st_biases(long *gyro, long *accel, unsigned char hw_test)
{
    unsigned char data[MAX_PACKET_LENGTH];
    unsigned char packet_count, ii;
    unsigned short fifo_count;

    data[0] = 0x01;
    data[1] = 0;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->pwr_mgmt_1, 2, data))
        return -1;
    delay_ms(200);
    data[0] = 0;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->int_enable, 1, data))
        return -1;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->fifo_en, 1, data))
        return -1;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->pwr_mgmt_1, 1, data))
        return -1;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->i2c_mst, 1, data))
        return -1;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->user_ctrl, 1, data))
        return -1;
    data[0] = BIT_FIFO_RST | BIT_DMP_RST;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->user_ctrl, 1, data))
        return -1;
    delay_ms(15);
    data[0] = st.test->reg_lpf;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->lpf, 1, data))
        return -1;
    data[0] = st.test->reg_rate_div;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->rate_div, 1, data))
        return -1;
    if (hw_test)
        data[0] = st.test->reg_gyro_fsr | 0xE0;
    else
        data[0] = st.test->reg_gyro_fsr;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->gyro_cfg, 1, data))
        return -1;

    if (hw_test)
        data[0] = st.test->reg_accel_fsr | 0xE0;
    else
        data[0] = test.reg_accel_fsr;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->accel_cfg, 1, data))
        return -1;
    if (hw_test)
        delay_ms(200);

    /* Fill FIFO for test.wait_ms milliseconds. */
    data[0] = BIT_FIFO_EN;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->user_ctrl, 1, data))
        return -1;

    data[0] = INV_XYZ_GYRO | INV_XYZ_ACCEL;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->fifo_en, 1, data))
        return -1;
    delay_ms(test.wait_ms);
    data[0] = 0;
    if (SPI_Mem_Write(CS_IMU_Pin, st.reg->fifo_en, 1, data))
        return -1;

    SPI_Mem_Read(CS_IMU_Pin, st.reg->fifo_count_h, 2, [](uint8_t *data){
      fifo_count = (data[0] << 8) | data[1];
      packet_count = fifo_count / MAX_PACKET_LENGTH;
      gyro[0] = gyro[1] = gyro[2] = 0;
      accel[0] = accel[1] = accel[2] = 0;

      for (ii = 0; ii < packet_count; ii++) {
        short accel_cur[3], gyro_cur[3];
        SPI_Mem_Read(CS_IMU_Pin, st.reg->fifo_r_w, MAX_PACKET_LENGTH, [](uint8_t *data){
          accel_cur[0] = ((short)data[0] << 8) | data[1];
          accel_cur[1] = ((short)data[2] << 8) | data[3];
          accel_cur[2] = ((short)data[4] << 8) | data[5];
          accel[0] += (long)accel_cur[0];
          accel[1] += (long)accel_cur[1];
          accel[2] += (long)accel_cur[2];
          gyro_cur[0] = (((short)data[6] << 8) | data[7]);
          gyro_cur[1] = (((short)data[8] << 8) | data[9]);
          gyro_cur[2] = (((short)data[10] << 8) | data[11]);
          gyro[0] += (long)gyro_cur[0];
          gyro[1] += (long)gyro_cur[1];
          gyro[2] += (long)gyro_cur[2];
        });
      }
#ifdef EMPL_NO_64BIT
      gyro[0] = (long)(((float)gyro[0]*65536.f) / test.gyro_sens / packet_count);
      gyro[1] = (long)(((float)gyro[1]*65536.f) / test.gyro_sens / packet_count);
      gyro[2] = (long)(((float)gyro[2]*65536.f) / test.gyro_sens / packet_count);
      if (has_accel) {
          accel[0] = (long)(((float)accel[0]*65536.f) / test.accel_sens /
              packet_count);
          accel[1] = (long)(((float)accel[1]*65536.f) / test.accel_sens /
              packet_count);
          accel[2] = (long)(((float)accel[2]*65536.f) / test.accel_sens /
              packet_count);
          /* Don't remove gravity! */
          accel[2] -= 65536L;
      }
#else
      gyro[0] = (long)(((long long)gyro[0]<<16) / test.gyro_sens / packet_count);
      gyro[1] = (long)(((long long)gyro[1]<<16) / test.gyro_sens / packet_count);
      gyro[2] = (long)(((long long)gyro[2]<<16) / test.gyro_sens / packet_count);
      accel[0] = (long)(((long long)accel[0]<<16) / test.accel_sens /
          packet_count);
      accel[1] = (long)(((long long)accel[1]<<16) / test.accel_sens /
          packet_count);
      accel[2] = (long)(((long long)accel[2]<<16) / test.accel_sens /
          packet_count);
      /* Don't remove gravity! */
      if (accel[2] > 0L)
          accel[2] -= 65536L;
      else
          accel[2] += 65536L;
#endif
    });

